# Params Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteFace..::..Params Property
HermiteFace Class See Also
---
Parameters of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray this[
	int index
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Params ( _
	index As Integer _
) As DoubleArray
	Get
```

Visual C++
---
```text
public:
property DoubleArray^ Params[int index] {
	DoubleArray^ get (int index);
}
```

# ### Parameters
index
    Type: System..::..Int32
# See Also
HermiteFace Class
Autodesk.Revit.DB Namespace